# a = {"a", "b", "c", "d", "e", "f", "f"}
# # конструктору set можно передать любой итерируемый объект
# b = set(["a", "b", "c", "d", "e", "f"])
# c = set(("a", "b", "c", "d", "e", "e", "f", "f"))
# # порядок элементов неважен
# d = set(["d", "e", "f", "a", "b", "c"])
# # деструктурирование списка
# e = {*["a", "b", "c", "d", "e", "f"]}
# assert a == b == c == d == e

# # в одном множестве могут храниться значения разных типов
# f = set(["a", True, 123])
# g = {"a", True, 123, True, 123}
# assert f == g

# # set() - это множество, а {} - это словарь
# assert set() != {}
